# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    'name' : ['Mabtoor','Waqas','Waheed','Horair'],
    'class' : ['BSCS', 'BSSE','BSBI','BSIT'],
    'RollNo' : [3144,6534,6742,3674],
    'Marks' : [96,84,86,89]
}

In [3]:
dict1

{'name': ['Mabtoor', 'Waqas', 'Waheed', 'Horair'],
 'class': ['BSCS', 'BSSE', 'BSBI', 'BSIT'],
 'RollNo': [3144, 6534, 6742, 3674],
 'Marks': [96, 84, 86, 89]}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

      name class  RollNo  Marks
0  Mabtoor  BSCS    3144     96
1    Waqas  BSSE    6534     84
2   Waheed  BSBI    6742     86
3   Horair  BSIT    3674     89

In [6]:
df.to_csv('Mabtoor.csv')

In [7]:
df.to_csv('Mabtoor_without_indexing', index=False)

In [9]:
dictionery = {
    'TrainNo': [43,65,74,85,24,64,73],
    'SeatNo' : [54,63,54,63,45,46,46],
    'PassangersName' : ['Zeeshan', 'Atif', 'Zaka', 'Umar', 'taqveem','Mrs.Choudary', 'Umer Yaqoob'],
    'Destinations' : ['Malaysia','Sydney','Bahawalpur', 'Faisalabad','Jehlum', 'Lahore', 'Faisalabad']
}

In [10]:
dictionery

{'TrainNo': [43, 65, 74, 85, 24, 64, 73],
 'SeatNo': [54, 63, 54, 63, 45, 46, 46],
 'PassangersName': ['Zeeshan',
  'Atif',
  'Zaka',
  'Umar',
  'taqveem',
  'Mrs.Choudary',
  'Umer Yaqoob'],
 'Destinations': ['Malaysia',
  'Sydney',
  'Bahawalpur',
  'Faisalabad',
  'Jehlum',
  'Lahore',
  'Faisalabad']}

In [11]:
df = pd.DataFrame(dictionery)

In [12]:
df

   TrainNo  SeatNo PassangersName Destinations
0       43      54        Zeeshan     Malaysia
1       65      63           Atif       Sydney
2       74      54           Zaka   Bahawalpur
3       85      63           Umar   Faisalabad
4       24      45        taqveem       Jehlum
5       64      46   Mrs.Choudary       Lahore
6       73      46    Umer Yaqoob   Faisalabad

In [26]:
df.to_csv('Personal_Friends.csv')

In [27]:
df.to_csv('Personal_Friends_Info_Without_Indices.csv', index=False)

In [16]:
df.head()

   TrainNo  SeatNo PassangersName Destinations
0       43      54        Zeeshan     Malaysia
1       65      63           Atif       Sydney
2       74      54           Zaka   Bahawalpur
3       85      63           Umar   Faisalabad
4       24      45        taqveem       Jehlum

In [17]:
df.tail()

   TrainNo  SeatNo PassangersName Destinations
2       74      54           Zaka   Bahawalpur
3       85      63           Umar   Faisalabad
4       24      45        taqveem       Jehlum
5       64      46   Mrs.Choudary       Lahore
6       73      46    Umer Yaqoob   Faisalabad

In [18]:
df.head(2)

   TrainNo  SeatNo PassangersName Destinations
0       43      54        Zeeshan     Malaysia
1       65      63           Atif       Sydney

In [19]:
df.tail(2)

   TrainNo  SeatNo PassangersName Destinations
5       64      46   Mrs.Choudary       Lahore
6       73      46    Umer Yaqoob   Faisalabad

In [20]:
df.describe()

         TrainNo     SeatNo
count   7.000000   7.000000
mean   61.142857  53.000000
std    20.844092   7.788881
min    24.000000  45.000000
25%    53.500000  46.000000
50%    65.000000  54.000000
75%    73.500000  58.500000
max    85.000000  63.000000

In [34]:
mabtoor = pd.read_csv('My_Personal.csv')

In [35]:
mabtoor

   Unnamed: 0  TrainNo  SeatNo PassangersName Destinations
0           0       42      54        Zeeshan     Malaysia
1           1       64      62           Atif       Sydney
2           2       78      51           Zaka   Bahawalpur
3           3       86      67           Umar   Faisalabad
4           4       34      49        taqveem       Jehlum
5           5       64      46   Mrs.Choudary       Lahore
6           6       77      44    Umer Yaqoob   Faisalabad

In [36]:
df

   TrainNo  SeatNo PassangersName Destinations
0       43      54        Zeeshan     Malaysia
1       65      63           Atif       Sydney
2       74      54           Zaka   Bahawalpur
3       85      63           Umar   Faisalabad
4       24      45        taqveem       Jehlum
5       64      46   Mrs.Choudary       Lahore
6       73      46    Umer Yaqoob   Faisalabad

In [43]:
df['TrainNo']

0    43
1    65
2    74
3    85
4    24
5    64
6    73
Name: TrainNo, dtype: int64

In [44]:
df['SeatNo'][0]

54

In [45]:
df['SeatNo'][0] = 34

<ipython-input-45-96f2bc627170>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['SeatNo'][0] = 34

In [46]:
df

   TrainNo  SeatNo PassangersName Destinations
0       43      34        Zeeshan     Malaysia
1       65      63           Atif       Sydney
2       74      54           Zaka   Bahawalpur
3       85      63           Umar   Faisalabad
4       24      45        taqveem       Jehlum
5       64      46   Mrs.Choudary       Lahore
6       73      46    Umer Yaqoob   Faisalabad

In [47]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [48]:
df.columns

Index(['TrainNo', 'SeatNo', 'PassangersName', 'Destinations'], dtype='object')

In [49]:
ser = pd.Series(np.random.randint(34))

In [50]:
ser

0    16
dtype: int64

In [51]:
type(ser)

pandas.core.series.Series

In [60]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [61]:
newdf

            0         1         2         3         4
0    0.999646  0.041808  0.145118  0.707398  0.762646
1    0.285439  0.508386  0.681820  0.362834  0.365149
2    0.822592  0.834434  0.466523  0.842519  0.956287
3    0.382259  0.477288  0.717101  0.234430  0.833142
4    0.165921  0.089459  0.804111  0.658834  0.791350
..        ...       ...       ...       ...       ...
329  0.522065  0.602779  0.280943  0.656950  0.725759
330  0.966015  0.999332  0.695016  0.517839  0.428819
331  0.110887  0.706553  0.422516  0.488674  0.184112
332  0.885882  0.919726  0.705123  0.892756  0.834389
333  0.369656  0.445310  0.806600  0.457328  0.651120

[334 rows x 5 columns]

In [62]:
newdf.head()

          0         1         2         3         4
0  0.999646  0.041808  0.145118  0.707398  0.762646
1  0.285439  0.508386  0.681820  0.362834  0.365149
2  0.822592  0.834434  0.466523  0.842519  0.956287
3  0.382259  0.477288  0.717101  0.234430  0.833142
4  0.165921  0.089459  0.804111  0.658834  0.791350

In [63]:
newdf.tail()

            0         1         2         3         4
329  0.522065  0.602779  0.280943  0.656950  0.725759
330  0.966015  0.999332  0.695016  0.517839  0.428819
331  0.110887  0.706553  0.422516  0.488674  0.184112
332  0.885882  0.919726  0.705123  0.892756  0.834389
333  0.369656  0.445310  0.806600  0.457328  0.651120

In [64]:
type(newdf)

pandas.core.frame.DataFrame

In [65]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [66]:
newdf.ndim

2

In [67]:
newdf.shape

(334, 5)

In [68]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [69]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [70]:
newdf[0][0]

0.9996455505874339

In [71]:
newdf[0][0] = 'Mabtoor'

In [73]:
type(newdf)

pandas.core.frame.DataFrame

In [74]:
newdf.to_numpy()

array([['Mabtoor', 0.04180828757569144, 0.1451181281020797,
        0.7073979625819873, 0.7626464447784431],
       [0.2854392535736936, 0.5083857604228111, 0.6818201146259826,
        0.36283361915497003, 0.36514891440618225],
       [0.8225923263506286, 0.8344340898830527, 0.4665228735958543,
        0.8425188936030851, 0.9562871050001898],
       ...,
       [0.11088667710009181, 0.7065529479680895, 0.4225163524343617,
        0.4886735858275265, 0.18411220683122786],
       [0.8858823909061146, 0.9197259006125696, 0.7051229270562259,
        0.892756161694062, 0.8343893435116961],
       [0.36965565988142013, 0.4453098202763468, 0.8065996647595678,
        0.45732796619060445, 0.6511202986898798]], dtype=object)

In [75]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,Mabtoor,0.285439,0.822592,0.382259,0.165921,0.360657,0.927623,0.821911,0.099581,0.364988,...,0.130685,0.577232,0.617656,0.68584,0.701432,0.522065,0.966015,0.110887,0.885882,0.369656
1,0.041808,0.508386,0.834434,0.477288,0.089459,0.047411,0.339323,0.024563,0.880494,0.725147,...,0.703367,0.157798,0.931134,0.830485,0.169679,0.602779,0.999332,0.706553,0.919726,0.44531
2,0.145118,0.68182,0.466523,0.717101,0.804111,0.882068,0.422831,0.024125,0.52053,0.713093,...,0.079856,0.961148,0.853122,0.814662,0.223855,0.280943,0.695016,0.422516,0.705123,0.8066
3,0.707398,0.362834,0.842519,0.23443,0.658834,0.206185,0.285196,0.396161,0.996553,0.964094,...,0.628189,0.167126,0.164187,0.144387,0.156317,0.65695,0.517839,0.488674,0.892756,0.457328
4,0.762646,0.365149,0.956287,0.833142,0.79135,0.231588,0.038505,0.793717,0.8449,0.003305,...,0.200677,0.81029,0.057955,0.654408,0.750726,0.725759,0.428819,0.184112,0.834389,0.65112